<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
  <head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8" />
    <meta name="description" content="Your description goes here." />
    <meta name="keywords" content="your,keywords,goes,here" />
    <meta name="author" content="Your Name / Original design by Andreas Viklund - http://andreasviklund.com" />
    <meta name="generator" content="webgen - http://webgen.rubyforge.org" />
    <link rel="stylesheet" href="../../default.css" type="text/css" media="screen" />
    <title>Roland Steinbauer - Smana</title>
  </head>

  <body>
<!--   <script src="../../jsMath/easy/load.js"></script>
   <noscript>
    <div style="color:#CC0000; text-align:center">
     <b>Warning: <a href="http://www.math.union.edu/locate/jsMath">jsMath</a>
     requires JavaScript to process the mathematics on this page.<br>
     If your browser supports JavaScript, be sure it is enabled.</b>
    </div>
   <hr>
   </noscript>
-->   


    <div id="container">

      <div id="sitename">
        <h1>Home Page of Roland Steinbauer</h1>
        <!--<h2>This page is still under construction</h2>-->
      </div>

      <div id="mainmenu">
        <ul><li class="webgen-menu-level1"><a href="../../index.html">Home</a></li><li class="webgen-menu-level1 webgen-menu-submenu"><a href="../../research/index.html">Research</a></li><li class="webgen-menu-level1 webgen-menu-submenu webgen-menu-submenu-inhierarchy"><a href="../index.html">Teaching</a></li><li class="webgen-menu-level1"><a href="../../vita.html">Vita</a></li></ul>
      </div>

      <div id="wrap">
        <div id="leftside"><br><br><br>
<!--	  <h2>Smana</h2>
          <div id="pagemenu"><br><br>
	  </div>
-->         
        <h2>Smana</h2>
        
         
         <div id="pagemenu"><br><br></div>
         
        
	</div>

        </div>

        <div id="rightside"><br><br><br>
         <h1>Links</h1>
          <ul class="linklist">
	    <li><a href="http://www.mat.univie.ac.at/~iagf" 
	           target="_blank">IAGF</a>   
		<img width="80" border="0" alt="A mollifier" 
		     src="../../images/molli.gif"><br></li>
	    <li><a href="http://mathisaac.org/c/serverisaac/" 
	           target="_blank">ISAAC</a></li>
	    <li><a href="http://www.mat.univie.ac.at/~diana" 
	           target="_blank">DIANA</a></li>
            <li><a href="http://www.mat.univie.ac.at/~nigsch/diana/" 
	                      target="_blank">Diana Seminar</a></li>
          <br><br>	            
	    <li><a href="http://www.mat.univie.ac.at/~einfbuch"
	           target="_blank">EMA-Buch</a></li>

	    <li><a href="http://bibliothek.univie.ac.at/fb-mathematik_statistik/" 
	           target="_blank">Math Library</a></li>
            <li><a href="http://mathematik.univie.ac.at" 
	           target="_blank">Math Faculty</a></li>
            <li><a href="http://www.univie.ac.at" 
	           target="_blank">Vienna University</a></li>
	    <li><a href="https://uspace.univie.ac.at/web/gast/home" 
	           target="_blank">u:space</a></li>
            <li><a href="https://ufind.univie.ac.at/en/index.html" 
	           target="_blank">u:find</a></li>
            <br><br>
              
	    
	    
	    <li><a href="http://lisamission.org" 
	           target="_blank">LISA</a></li>
            <!--<li><a href="http://www.oeaw.ac.at/gravitation2015/gravitation-2015/"
	           target="_blank">Gravitation 2015</a></li>-->
	    <li><a href="http://gravity.univie.ac.at/"
	           target="_blank">Gravitational Physics</a></li>
          
	    <br><br><br><br><br><br><br>


            <li><a href="http://www.skeptiker.at/" 
	                        target="_blank">GWUP</a>
	    <li><a href="http://www.asyl-in-not.org/"  
	           target="_blank">Asyl in Not</a>
            <li><a href="http://www.konfessionsfrei.at/" target="_blank">
	     <img src="../../images/laizitaet_fisch.gif" 
	          width="80" border="0"></a>
          <br><br><br>
          <li><a href="https://www.linuxfoundation.org/" target="_blank">
            <img align="bottom" alt="100% M$ free" 
	         src="../../images/msfree.gif" border="0">
            </a>
          </div>

        <div id="navbar" class="content">
          <span class="leftbox">Location: <a href="../../index.html">Home</a> / <a href="../index.html">Teaching</a> / <a href="./">Ws1819</a> / <span>Smana</span></span>
          <!--<span class="rightbox">Language: <span>en</span></span>-->
          <div class="clearingdiv">&nbsp;</div>
        </div>

        <div id="content">
          <p align="justify">
<center>
<h2>Schulmathematik Analysis</h2>
<h4>Winterersemester 2018<h4>
<h4>Roland Steinbauer, Evelyn S&uuml;ss-Stepancik</h4>
</center>

<b>Lehrveranstaltungsnummer:</b>250030<br>
<b>Lehrveranstaltungstyp:</b> VO<br>
<b>Semesterwochenstunden/ECTS:</b> 2/2<br>
<b>Zeit und Ort:</b> Mi 11:30-13:00, Hs. 4, OMP1<br>
<b>Beginn:</b> 3.10.2015<br>
<br><br><br>

<b>Neuigkeiten</b>[neueste oben]<br><br>
<em>2018-09-21:</em> Aufgabensammlung für die Übungen, <a href="UE-Blatt_1.pdf" target="_blank">Blatt 1 online</a>.<br>
<em>2018-09-20:</em> Webseite online 
<br><br><br><br>


<b>Allgemeines:</b> Die Analysis ist eines der zentralen Teilgebiete der Mathematik und in seiner Bedeutung kaum zu &uuml;bersch&auml;tzen.
Ebenso ist die Schulanalysis eine der tragenden S&auml;len der Schulmathematik. Ihr Kern besteht aus der Differential- und Integralrechnung 
für reelle Funktionen in einer Variablen, ihr zentraler Begriff ist der des Grenzwerts.<br><br>      

Als <b>Ziel</b> der Vorlesung (und der zugeh&ouml;rigen &Uuml;bungen) formuliert das Curriculum: <i>
Die Studierenden erkennen die Relevanz der fachmathematischen Konzepte für den
Schulunterricht und k&ouml;nnen diese dort angemessen verwenden. Sie kennen
verschiedene M&ouml;glichkeiten für Zug&auml;nge zu grundlegenden Themen des Analysis-
Schulunterrichts (und ihrer Anwendungen) und k&ouml;nnen diese bewerten. Die Studierenden
k&ouml;nnen in diesem Gebiet fachdidaktische Konzepte anwenden und Computer in
angemessener Weise einsetzen, sie kennen typische Fehlvorstellungen und passende
Interventionsm&ouml;glichkeiten.</i>
<br><br>

Um dieses Ziel zu erreichen, werden wir in der Vorlesung die Schulanalysis von einem h&ouml;heren Standpunkt aus betrachten. 
Das bedeutet, dass der Hauptstrang der Vorlesung die zentralen Inhalte der Schulanalysis behandelt, aus verschiedenen Perspektiven beleuchtet 
und ein umfassendes Verst&auml;ndnis der analytischen Kernbegriffe und ihrer Zusammenh&auml;nge herstellt. Dabei werden wir einerseits
an die Inhalte und (mathematischen) Methoden der Fachvorlesung ,,Analysis in einer Variable für das Lehramt'' ankn&uuml;pfen und andererseits 
ausf&uuml;hrlich Bez&uuml;ge zur Unterrichtspraxis herstellen. Wir stellen einen fachdidaktischen Begriffsrahmen zur Verf&uuml;gung, der es erlaubt, 
das mathematisches Fachwissen zu reflektieren und mathematikdidaktisches Professionswissen aufzubauen. Damit sollen die H&ouml;rer/innen 
bef&auml;higt, werden einen qualit&auml;tsvollen Analysis-Unterricht zu gestalten, der fachlich und fachdidaktisch fundiert ist und sich durch 
eine reflektierte Unterrichtspraxis ausgezeichnet.
<br><br>

<b>Hochschuldidaktischer Hintergrund:</b> 
Es gibt eine umfangreiche Literatur zum sog. Lehrerprofessionswissen. Durch große empirische Studien
ist belegt, dass sich das mathematische Lehrerwissen valide in die beiden Teilbereiche mathematical
content knowledge (MCK) und paedagogical context knowledge (PCK) unterteilen lässt. Letzteres könnte
man auch kurz „fachdidaktisches Handlungswissen“ nennen und ist Hauptpr&auml;diktor für den Lernerfolg
von Sch&uuml;lern/innen. MCK der Lehrkraft hat zwar auch einen positiven Einfluss auf die Unterrichtsqualit&auml;t,
reicht aber alleine nicht aus. Allerdings beruht PCK immer auf einer soliden Basis von MCK.
<br><br>

Dar&uuml;ber hinaus sind typische unterrichtliche Handlungsanforderungen an Lehrkr&auml;fte ebenfalls gut empirisch erforscht. 
Es ergeben sich z.B. folgende mathematischen Kernaufgaben, die Lehrer/innen in ihrer täglichen Praxis zu bewältigen haben:
<ul>
<li> Anforderungen an Sch&uuml;ler/innen (aus Schulb&uuml;chern, Tafelbildern oder
Tests) selbst bew&auml;ltigen und auf verschiedenen Niveaus bearbeiten können</li>
<li> Lernziele setzen und aussch&auml;rfen</li>
<li> Zug&auml;nge (in Schulb&uuml;chern, Tafelbildern o.&auml;.) analysieren und bewerten</li>
<li> Aufgaben und Lernanl&auml;sse auswählen, ver&auml;ndern oder konstruieren</li>
<li> Tests entwickeln und re-skalieren</li>
<li> geeignete Darstellungen und Exaktheitsstufen ausw&auml;hlen und nutzen sowie zwischen
ihnen vermitteln</li>
<li> &Auml;ußerungen von Lernenden analysieren, bewerten und darauf lernf&ouml;rderlich reagieren</li>
<li> Fehler von Lernenden analysieren und darauf lernf&ouml;rderlich reagieren</li>
<li> fachlich substantielle, produktive Diskussionen moderieren</li>
<li> zwischen verschiedenen Sprachebenen (Alltagssprache,
 Fachsprache,Symbolsprache) flexibel hin-und herwechseln</li>
<li> Lernst&auml;nde, Lernprozesse und Lernerfolge erfassen</li>
<li> Begriffe und Konzepte erklären und Bez&uuml;ge herstellen</li>
</ul>
Ebenso wird in der Literatur darauf hingewiesen, dass fachliche Inhalte im Bewusstsein der Lehrkr&auml;fte geeignet 
repr&auml;sentiert sein m&uuml;ssen, damit diese f&auml;hig sind, Aufgaben des obigen Anforderungskatalogs effektiv zu bew&auml;ltigen.
<br><br>

Die Orientierung an obigen Punkten liefert uns ein leitendes Prinzip, um die
Inhalte und ihre konkrete Ausgestaltung, die Methoden und den Geist der Vorlesung praxisnahe zu 
gestalten. In der Vorlesung aber vor allem in den &Uuml;bungen  werden wir diese Kernaufgaben 
trainieren und ein Bewusstsein für die mathematischen T&auml;tigkeiten schaffen, die die Unterrichtspraxis bestimmen.
<br><br> 
 

<b>Inhalt:</b> 
<ul>
<li>Was will und was soll die (Schul-)analysis</li>
<li>Fachdidaktischer Begriffsrahmen (Grunderfahrungen, Grundvorstellungen und Aspekte)</li>
<li>Funktionsbegriff</li>
<li>Folgen, Grenzwert und Vollst&auml;ndigkeit der reellen Zahlen</li>
<li>Differentialrechnung</li>
<li>Integralrechung</li>
<li>Spezielle Funktionen</li>
</ul>
<br>


<b>Literatur:</b> Unsere beiden Hauptbezugspunkte sind<br>
<ul>
<li>R. Danckwerts, D. Vogel, Analysis verst&auml;ndlich unterrichten (Spektrum, Heildeberg, 2006) und</li>
<li>G. Greefrath, R. Oldenburg, H.-S. Siller, V. Ulm, H.-G. Weigand,  Didaktik der Analysis.
Aspekte und Grundvorstellungen zentraler Begriffe (Springer-Spektrum, Berlin, 2016).</li>
</ul>
Dar&uuml;ber hinaus werden wir uns vielfach auf aktuelle Schulb&uuml;cher beziehen. Als Quellen f&uuml;r die Hochschul-Analysis verwenden wir einschl&auml;gigen B&uuml;cher von Forster, Behrends und Deiser. Eine inspirierende Quelle ist auch das ,,Arbeitsbuch Analysis'' von Thomas Bauer (Springer-Spektrum, Wiesbaden, 2013).
<br><br>

<b>Voraussetzung</b> f&uuml;r einen erfolgreichen Besuch der Lehrveranstaltung sind Grundkenntnisse der (Hochschul-)Analysis im
Ausma&szlig; der Vorlesung und der Übungen ,,Analysis in einer Variable für das Lehramt''.
<br><br>

<B>Positionierung im Curriculum:</B>
Teil des Pflichtmoduls Analysis (UF MA 4) UF Mathematik BA Lehramt.
<br><br>

<b>Skriptum:</b> Wir werden ein Skriptum erarbeiten und kapitelweise im Nachhinein an dieser Stelle bereitstellen.
<br><br>


<a name="prfg"></a>
Die <b>Pr&uuml;fungen</b> besteht aus einer schriftlichen Klausurarbeit. Alle Details werden in der Vorlesung zeitgerecht bekanntgegeben.
Die Pr&uuml;fungstermine sind bereits in u:space ver&ouml;ffentlicht.
<br><br>



<br><br><br><br><br><br>






        </div>
        <div class="clearingdiv">&nbsp;</div>

      </div>
    </div>

    <div id="footer">&copy; 2009-2017 Roland Steinbauer | Generated by <a href="http://webgen.rubyforge.org" target="_blank">webgen</a> | Design by <a href="http://andreasviklund.com" target="_blank">Andreas Viklund</a>  | Mathematics by <a href="http://www.math.union.edu/~dpvc/jsMath/welcome.html">jsMath</a></div>

 <script>
  jsMath.Process(document);
  </script>


  </body>
</html>
